{
  "backend/main.mo": "Motoko canister implementing the core ledger: transaction types, balances, daily/monthly stats, opening balances, and access control with admin/user roles. Manages transactions, deductions, savings, balance calculations, and user registration with persistent state.",
  "feature_evidence.json": "Machine-readable report documenting implemented features, affected frontend files, dependencies, test IDs, and confidence levels, mainly around supporting negative amounts and correct sign handling across the UI and calculations.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of major frontend files, components, and hooks, describing UI structure, offline-first behavior, authentication, and financial tracking features.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application via main.tsx with basic metadata.",
  "frontend/src/App.tsx": "Top-level React component controlling offline PIN authentication flow, global layout, loading states, and switching between PIN auth and the main dashboard.",
  "frontend/src/components/BackupRestore.tsx": "UI component providing local JSON backup and restore functionality with expandable sections, file validation, success/error alerts, and React Query mutations.",
  "frontend/src/components/BalanceCards.tsx": "Dashboard component displaying financial overview cards (total, cash, UPI, savings, deductions) with loading/error states, refresh support, formatted amounts, and navigation to add transactions.",
  "frontend/src/components/DailyTracking.tsx": "File present but content not provided; likely responsible for displaying or managing per-day transaction and deduction tracking in the UI.",
  "frontend/src/components/DaywiseTransactions.tsx": "Displays transactions for a selected day with calendar navigation, calculates daily stats (cash/UPI in/out, deductions, net), and allows setting a per-day user deduction synced to backend and localStorage.",
  "frontend/src/components/EditTransactionDialog.tsx": "Modal dialog for editing an existing transaction’s type, amount, description, and date, submitting updates via a React Query mutation.",
  "frontend/src/components/FilterTransactions.tsx": "Filters transactions between a start and end date, computes aggregate statistics (inflows, outflows, deductions, net), and stays in sync with React Query cache and localStorage.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a branded link with a heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app branding and authenticated actions for backup, restore, clear data, and logout using corresponding backend mutations.",
  "frontend/src/components/MonthlyTransactions.tsx": "Shows transactions filtered by selected month and transaction type, with totals, formatted table display, and month/type selectors.",
  "frontend/src/components/OpeningBalancesForm.tsx": "React form for creating or updating an opening balance with cash, UPI, savings, deductions, and date, loading existing data if present. Uses query hooks to fetch, add, or update balances and manages UI states like edit mode, success feedback, and expand/collapse.",
  "frontend/src/components/PinAuth.tsx": "PIN-based authentication component handling PIN setup, confirmation, verification, and reset flows. Manages OTP-style input, loading/error states, and delegates auth actions via provided callback props.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces first-time users to enter and save their name to complete profile setup. Submits the name via a mutation hook and blocks dismissal until completion.",
  "frontend/src/components/TransactionForm.tsx": "Form for adding a financial transaction with type, amount, description, and date, supporting preselected transaction types. Submits transactions via a mutation hook and resets state with success feedback.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a list of transactions with filtering, formatting, and status badges. Supports editing and deleting transactions using dialogs and integrates with query hooks for data fetching and mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity using React Query. Recreates the actor on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, including login, logout, and identity persistence. Wraps AuthClient logic and exposes detailed login status flags to consumers.",
  "frontend/src/hooks/usePinAuth.ts": "Custom React hook that manages local PIN-based authentication using SHA-256 hashing, localStorage/sessionStorage, and exposes setup, verify, logout, and reset helpers with auth state.",
  "frontend/src/hooks/useQueries.ts": "Central data-access hook built on TanStack React Query that manages transactions, balances, user profile, and related financial data with localStorage persistence and bigint serialization.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining the app’s color theme, gradients, animations, and extensive UI overrides for dropdowns, calendars, and visual consistency.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page implementing a tabbed interface for overview, adding transactions, history, filtering, and day/month-wise views, with state-driven tab navigation.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL and hash-based parameters using sessionStorage, supporting state persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content sources, centered container settings, extensive theme extensions for CSS-variable–driven colors, border radii, and animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata and high-level state describing an offline-first React/TypeScript financial ledger app, including schema/versioning, an overall project summary, and a detailed list of existing features with IDs, descriptions, and versions."
}