{
  "backend/main.mo": "Defines transaction types, data models, balance calculations, daily stats, access control initialization, and in-memory maps for transactions and user profiles in a Motoko actor.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains high-level textual summaries of various frontend source files and their functionality.",
  "frontend/index.html": "Base HTML document that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling PIN-based offline authentication and rendering the dashboard or auth screens with global layout.",
  "frontend/src/components/BackupRestore.tsx": "Provides UI for exporting and importing backup JSON files with expandable sections and success/error handling.",
  "frontend/src/components/BalanceCards.tsx": "Displays total and categorized balances with clickable gradient tiles that trigger transaction-type actions.",
  "frontend/src/components/DailyTracking.tsx": "Empty or placeholder component file containing no implementation.",
  "frontend/src/components/DaywiseTransactions.tsx": "Displays transactions for a selected day, calculates stats, and stores per‑day user deductions in localStorage.",
  "frontend/src/components/EditTransactionDialog.tsx": "Dialog for editing an existing transaction with form fields and mutation handling.",
  "frontend/src/components/FilterTransactions.tsx": "Filters transactions by date range and computes grouped daily stats with user deductions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with backup, restore, reset, and logout controls for authenticated users.",
  "frontend/src/components/MonthlyTransactions.tsx": "Shows transactions filtered by month or year with type and search options and derived summary rows.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form component to view, edit, and submit opening balance data with date handling and success feedback.",
  "frontend/src/components/PinAuth.tsx": "Handles PIN setup and verification with state management, error handling, and reset flow.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name during profile setup.",
  "frontend/src/components/TransactionForm.tsx": "Form for creating transactions with type selection, date input, and submission via API.",
  "frontend/src/components/TransactionHistory.tsx": "Displays, filters, and manages transactions by month with edit and delete actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, identity state, and persistence.",
  "frontend/src/hooks/usePinAuth.ts": "React hook managing PIN setup, hashing, verification, and session-based authentication using localStorage and sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "React Query utilities plus localStorage helpers for transactions, balances, user data, and opening balances with bigint handling.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, UI component overrides, animations, and enhanced calendar/select styling.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI with tab navigation, archive month selection, transaction form setup, and overview interactions.",
  "frontend/src/utils/derivedTransactions.ts": "Generates derived transaction rows such as 10% savings and cheeti deductions based on stored transactions and user deductions.",
  "frontend/src/utils/transactionDirection.ts": "Utility for determining transaction direction and returning corresponding color classes for amounts and icons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, features, and pending requests related to improving month archive UI and restoring visibility of older months’ history."
}