{
  "backend/main.mo": "Defines transaction types, data models, balance tracking, user access control, and stateful maps for managing financial transactions and user profiles in a Motoko canister.",
  "feature_evidence.json": "Provides structured evidence mapping required features to relevant frontend files, components, and test IDs for monthly transaction enhancements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing responsibilities and behaviors of various frontend files across the application.",
  "frontend/index.html": "Basic HTML entry point that sets up the root div and loads the main React application module.",
  "frontend/src/App.tsx": "Handles PIN authentication flow, initializes app state, clears cache on logout, and conditionally renders either auth screens or the dashboard.",
  "frontend/src/components/BackupRestore.tsx": "Implements JSON backup and restore functionality with UI feedback, file validation, and collapsible sections for backup and restore actions.",
  "frontend/src/components/BalanceCards.tsx": "Displays financial overview cards with balances, cumulative stats, loading/error states, and click navigation to add transactions.",
  "frontend/src/components/DailyTracking.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/DaywiseTransactions.tsx": "Displays transactions for a selected day, allows editing daily deductions, and filters transactions by date with local storage support.",
  "frontend/src/components/EditTransactionDialog.tsx": "Modal dialog for editing a transaction’s type, amount, description, and date, submitting updates via a mutation.",
  "frontend/src/components/FilterTransactions.tsx": "Provides date‑range filtering of transactions, computes summary stats, and reacts to cache updates while loading data from local storage.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar offering backup, restore, data reset, and logout controls for authenticated users.",
  "frontend/src/components/MonthlyTransactions.tsx": "Filters and displays monthly transactions or derived rows by type with search and month selection.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form component to create or update opening balances, loading existing data, handling date conversion, and submitting mutations.",
  "frontend/src/components/PinAuth.tsx": "Handles PIN setup, confirmation, verification, and reset with state transitions and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user for their name and saving the profile via a mutation.",
  "frontend/src/components/TransactionForm.tsx": "Form to create a transaction, supporting preselected types, date picking, validation, and submitting mutations.",
  "frontend/src/components/TransactionHistory.tsx": "Displays all transactions with filtering, editing, deleting, and merging derived rows for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and stored identity restoration using AuthClient.",
  "frontend/src/hooks/usePinAuth.ts": "Provides a PIN-based auth hook handling setup, verification, session restore, and reset using local and session storage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and local‑storage helpers for transactions, balances, profiles, deductions, savings, and opening balances.",
  "frontend/src/index.css": "Configures Tailwind theme variables and styles, including gradients, visibility overrides, animations, and calendar UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tabbed navigation for overview, adding transactions, history, filtering, and date-based views.",
  "frontend/src/utils/derivedTransactions.ts": "Generates and merges derived transaction rows like savings and deductions using local storage data and date normalization.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from session or URL hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, container settings, border radius, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, existing features, new feature requests, and tracking info for project state."
}