{
  "backend/main.mo": "Defines transaction, balance, stats, and access-control logic with storage maps and role enforcement for a financial tracking canister.",
  "feature_evidence.json": "Feature report linking a UI color‑coding update to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains short descriptions of numerous frontend files for documentation or build‑planning purposes.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling PIN‑based offline auth, loading states, cache clearing, and rendering the dashboard.",
  "frontend/src/components/BackupRestore.tsx": "UI component providing backup and restore operations with success/error alerts, file input handling, and collapsible sections.",
  "frontend/src/components/BalanceCards.tsx": "Displays financial overview cards using balance and stats queries, with refresh support and navigation to add transactions.",
  "frontend/src/components/DailyTracking.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/DaywiseTransactions.tsx": "Displays daily transactions with date selection, shows derived totals, and lets users save per-day deduction values to localStorage.",
  "frontend/src/components/EditTransactionDialog.tsx": "Modal dialog for editing an existing transaction, pre-filling fields and submitting updates via mutation.",
  "frontend/src/components/FilterTransactions.tsx": "Filters transactions by date range, computes per-day totals and deductions, and displays results in a table.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, logout, data backup, restore, and clear-data controls.",
  "frontend/src/components/MonthlyTransactions.tsx": "Displays monthly transactions with filters for type, search, and derived rows, merging real and computed entries.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form to add or update opening balances, loading existing data and submitting via query mutations.",
  "frontend/src/components/PinAuth.tsx": "Handles PIN setup and verification with UI feedback, confirmation flow, and reset support.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting user to enter and save their name during profile setup.",
  "frontend/src/components/TransactionForm.tsx": "Form to create transactions with type selection, date picker, validation, and submission via mutation.",
  "frontend/src/components/TransactionHistory.tsx": "Displays, filters, edits, and deletes transactions using derived rows and dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and logout operations.",
  "frontend/src/hooks/usePinAuth.ts": "Provides PIN-based local authentication with setup, verification, session restore, and reset using hashed PINs in local storage.",
  "frontend/src/hooks/useQueries.ts": "Manages local storage caching and React Query interactions for transactions, balances, user data, and opening balances with bigint handling.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, component overrides, animations, and enhanced UI styling for calendars and dropdowns.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabbed navigation for overview, adding transactions, history, filtering, and date-based views.",
  "frontend/src/utils/derivedTransactions.ts": "Generates and merges UI‑only derived rows such as 10% savings and cheeti deductions using local storage values.",
  "frontend/src/utils/transactionDirection.ts": "Maps transaction types to incoming/outgoing directions and supplies corresponding color and icon classes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, extended animations, and plugin integrations.",
  "project_state.json": "Stores project metadata including state version, feature lists, and pending feature requests."
}