{
  "backend/main.mo": "Defines transaction types, balance and stats structures, and initializes maps and access control for managing financial transactions with role-based access.",
  "feature_evidence.json": "Lists feature evidence entries linking frontend files to feature requirements, components, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files and their roles in the application.",
  "frontend/index.html": "Basic HTML shell that mounts the React application and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component handling PIN authentication flow, loading states, logout clearing, and rendering the dashboard.",
  "frontend/src/components/BackupRestore.tsx": "UI component enabling JSON backup and restore with status alerts, file validation, and collapsible sections.",
  "frontend/src/components/BalanceCards.tsx": "Displays balance overview cards and tiles with formatted amounts, loading/error states, and tile click handling.",
  "frontend/src/components/DailyTracking.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/DaywiseTransactions.tsx": "Component that displays transactions for a selected day, loads user deductions from localStorage, and shows totals and derived rows. Includes date picker, user deduction input, and filtered transaction table.",
  "frontend/src/components/EditTransactionDialog.tsx": "Dialog for editing a transaction with fields for type, amount, description, and date, initialized from the provided transaction. Submits updates via useEditTransaction and closes on success.",
  "frontend/src/components/FilterTransactions.tsx": "Component that filters transactions between two dates, groups them by day, computes totals and deductions, and displays results in a table. Includes dual date pickers and derived-row calculations.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Header with app title, logout handling, and authenticated actions for data backup, restore, and clearing all transactions. Uses file input for restore and mutation hooks for backup/clear.",
  "frontend/src/components/MonthlyTransactions.tsx": "Component for viewing transactions by month or year with filters for type and search query. Computes derived rows and shows sorted results in a table.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form to load, create, or update opening balances with date handling and success feedback.",
  "frontend/src/components/PinAuth.tsx": "PIN setup and verification UI supporting confirmation, reset, and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name during profile setup.",
  "frontend/src/components/TransactionForm.tsx": "Form to add a transaction with type selection, date picking, validation, and success reset.",
  "frontend/src/components/TransactionHistory.tsx": "Displays, filters, and manages transactions with edit/delete and derived summary rows.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, and persisted identity state.",
  "frontend/src/hooks/usePinAuth.ts": "React hook handling PIN setup, hashing, verification, session restore, and reset using localStorage and sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query wrappers and localStorage helpers for transactions, balances, profiles, deductions, and opening balances with bigint serialization.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, gradients, animations, and UI overrides for dropdowns and calendar components.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity provider before rendering the App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page managing tabs, archive month selection, preselected transaction types, and rendering balance, transaction, and filtering components.",
  "frontend/src/utils/derivedTransactions.ts": "Generates derived transaction rows such as 10% savings and deductions by analyzing local transactions and date ranges.",
  "frontend/src/utils/transactionDirection.ts": "Utility for determining transaction direction and providing consistent color and icon classes based on incoming or outgoing type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove them from the hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration, extending theme colors, container settings, animations, and enabling plugins.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to date picker styling, year-wise views, and overview filtering."
}