{
  "backend/main.mo": "Defines transaction types, balances, daily stats, opening balances, and access control logic, storing transactions and user profiles with utilities for comparison and role management.",
  "feature_evidence.json": "Lists feature evidence records describing feature IDs, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for multiple frontend source files across the application.",
  "frontend/index.html": "Minimal HTML wrapper that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Manages PIN authentication, initialization, and routing between auth screen and dashboard, clearing React Query cache on logout.",
  "frontend/src/components/BackupRestore.tsx": "UI component for exporting and importing JSON backups with success/error alerts, collapsible sections, and file handling.",
  "frontend/src/components/BalanceCards.tsx": "Displays financial overview cards using balance and stats queries, with loading/error states and navigation to Add Transaction.",
  "frontend/src/components/DailyTracking.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/DaywiseTransactions.tsx": "Displays transactions for a selected day, allows editing daily deductions, and filters data from all transactions using local storage and query hooks.",
  "frontend/src/components/EditTransactionDialog.tsx": "Provides a dialog to edit a transaction’s type, amount, description, and date, submitting updates via a mutation hook.",
  "frontend/src/components/FilterTransactions.tsx": "Filters transactions by date range, computes summary stats, and reacts to query cache updates while using local storage as fallback.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with logout, backup, restore, and data-clear controls depending on authentication state.",
  "frontend/src/components/MonthlyTransactions.tsx": "Filters transactions by month and type, shows totals, and displays results in a table with formatted values.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form to view, create, or update opening balances with date selection, loading state, and success handling.",
  "frontend/src/components/PinAuth.tsx": "PIN setup and authentication component with support for verification, confirmation, reset, and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user for their name and saving it via a profile API call.",
  "frontend/src/components/TransactionForm.tsx": "Form for adding transactions with type selection, amount input, date picking, and success feedback.",
  "frontend/src/components/TransactionHistory.tsx": "Displays all transactions with filtering, editing, deletion, and merged derived rows.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hook for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/usePinAuth.ts": "Provides PIN-based local authentication with hashing, session restore, setup, verification, logout, and reset helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and local‑storage helpers for transactions, balances, user data, deductions, and opening balances.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, gradients, component overrides, and calendar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabbed navigation for overview, transactions, filtering, and reports.",
  "frontend/src/utils/derivedTransactions.ts": "Generates derived transaction rows (10% savings, cheeti deductions), normalizes dates, and merges them with real transactions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings with plugin support.",
  "project_state.json": "JSON document tracking project state, feature requirements, known issues, and the goal of displaying derived savings and cheeti deduction rows."
}