{
  "backend/main.mo": "Defines transaction types, balances, stats, user profiles, and access control logic with maps for storing transactions, deductions, and opening balances.",
  "feature_evidence.json": "Lists feature evidence entries describing Monthly Transactions UI fixes with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their purpose and behavior in the app.",
  "frontend/index.html": "Base HTML file setting up the root container and loading the main React entry script.",
  "frontend/src/App.tsx": "Handles PIN authentication flow, initializes app state, and renders either the auth screen or the dashboard based on login status.",
  "frontend/src/components/BackupRestore.tsx": "Component providing UI and logic for backing up and restoring data via JSON files with success and error alerts.",
  "frontend/src/components/BalanceCards.tsx": "Displays balance overview cards with loading and error states and supports navigation to preselected transaction types.",
  "frontend/src/components/DailyTracking.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/DaywiseTransactions.tsx": "Renders daily transactions with date selection, local storage deductions, and derived calculations. Fetches all transactions and displays totals and user-entered deductions.",
  "frontend/src/components/EditTransactionDialog.tsx": "Provides a dialog to edit an existing transaction, preloading data and submitting updates through a mutation. Handles type, amount, description, and date changes.",
  "frontend/src/components/FilterTransactions.tsx": "Filters transactions by date range and aggregates cash-in, UPI-in, and deductions using local storage. Displays computed stats for each day within the selected range.",
  "frontend/src/components/Footer.tsx": "Static footer showing branding and a link to caffeine.ai with a decorative heart icon.",
  "frontend/src/components/Header.tsx": "Header with branding and authenticated actions like backup, restore, and clearing data. Includes tooltips, file upload handling, and logout support.",
  "frontend/src/components/MonthlyTransactions.tsx": "Shows monthly transactions with type filters, search, and merged derived rows. Fetches all transactions and filters them by month, type, and text.",
  "frontend/src/components/OpeningBalancesForm.tsx": "Form component to load, display, edit, and save opening cash, UPI, savings, and deduction balances with date selection.",
  "frontend/src/components/PinAuth.tsx": "Handles PIN setup and verification flow with UI states, validation, and reset logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/TransactionForm.tsx": "Form for creating transactions with type selection, amount, description, date, and submission handling.",
  "frontend/src/components/TransactionHistory.tsx": "Displays all transactions with filtering, edit/delete dialogs, and derived row handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login/logout, and managing authentication state.",
  "frontend/src/hooks/usePinAuth.ts": "Provides PIN-based local auth with setup, verification, session restore, and reset using hashed PINs in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks and helpers for transactions, balances, user data, and opening balances with localStorage persistence.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, theme variables, gradients, animations, and UI overrides for calendars and dropdowns.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI with tab-based navigation for overview, adding transactions, history, filtering, and date-based views.",
  "frontend/src/utils/derivedTransactions.ts": "Generates and merges derived transaction rows like savings and deductions using localStorage data.",
  "frontend/src/utils/transactionDirection.ts": "Determines transaction direction and returns consistent color and icon classes based on type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS content paths, theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s state, including known issues and existing feature requirements for fixing a blank screen bug."
}