{
  "kind": "build_request",
  "title": "Improve month archive UI and restore access to older months in History",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Overview Archive UI so the selected month name is displayed inside a clear, tile-like element (within the Archive area) rather than being only part of a long button label.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Place the month name inside the respective tile"
        ]
      },
      "acceptanceCriteria": [
        "On the Overview tab, the Archive section shows the selected month/year prominently inside a tile/card element (e.g., a bordered/filled pill or mini-card) that is visually distinct from the calendar trigger button.",
        "The month/year shown in the tile updates immediately when the user selects a different month.",
        "User-facing text remains in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Relocate and redesign the month archive selection control to a more intuitive placement and layout so it does not dominate the Overview tab content while still being easily discoverable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "place the month archive option In the better place"
        ]
      },
      "acceptanceCriteria": [
        "The archive month selector (calendar trigger) is placed in a more compact, intuitive position within the Overview tab (e.g., aligned to the right of the Archive header, or otherwise reducing vertical space).",
        "The reset action remains available when viewing an archived month and is clearly associated with the archive controls.",
        "The BalanceCards grid remains fully visible without excessive scrolling on typical viewport sizes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the History tab so users can view transaction history for older months directly from the History screen (without requiring a tile click from Overview) by providing month/year selection controls and applying them to the History filtering logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "also history cannot be seen of old months, fix this"
        ]
      },
      "acceptanceCriteria": [
        "In the History tab (TransactionHistory), provide an in-page control to select a month/year to view (can reuse the calendar-popover pattern used in Dashboard).",
        "Selecting an older month in History updates the displayed transactions for that month immediately (no full page reload).",
        "A clear action exists to return to the current month from an archived month view.",
        "If Overview has already set session parameters (overviewArchiveYear/overviewArchiveMonth), History uses them as the initial selection when opening the History tab.",
        "By default (no archive selection), History continues to show the current month."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Do not add new authentication methods (Internet Identity only).",
    "Do not introduce real-time updates (no WebSockets).",
    "Do not change transaction data structures or add new transaction types unless required for the UI fixes above."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}