{
  "kind": "build_request",
  "title": "Fix blank screen when clicking the Monthly tab",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the runtime error that causes the app to render a blank screen when the user clicks the \"Monthly\" tab in the Dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "As soon as \"monthly\" tab is clicked screen is going blank , fix this"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the \"Monthly\" tab no longer results in a blank screen.",
        "The Monthly Transactions view renders successfully on first load (even with no transactions).",
        "No uncaught exceptions are thrown in the browser console when switching to the Monthly tab."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden the Monthly Transactions UI against common data-shape issues so it cannot crash during filtering/searching (e.g., missing/empty description values, unexpected transactionType values) and instead continues rendering with safe fallbacks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "As soon as \"monthly\" tab is clicked screen is going blank , fix this"
        ]
      },
      "acceptanceCriteria": [
        "Typing into the Monthly search box does not crash the page even if some transactions have empty/undefined descriptions.",
        "Filtering by each transaction type option (and derived row types) does not crash the page and produces a stable rendered table state.",
        "When an unexpected/unknown transaction type is encountered, the UI displays a reasonable fallback label (e.g., \"Unknown\") and continues rendering."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not modify files listed in frontend.immutablePaths (compose around them instead)."
  ],
  "nonGoals": [
    "No backend/canister logic changes are required unless the frontend fix definitively depends on backend type/schema changes.",
    "No new features beyond fixing the Monthly tab blank-screen bug and making the view resilient to bad/partial data."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}