{
  "kind": "build_request",
  "title": "Show 10% savings and cheeti deductions as visible entries in transaction lists (history/daily/monthly/filter)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the computed 10% savings deduction and the user-defined cheeti (daily deduction) appear as visible, non-editable, non-deletable transaction rows in all transaction list views: Transaction History, Day-wise Transactions, Filter Transactions results, and Monthly Transactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "Just keep everything as it is, just the savings 10% and the user defined cheeti deduction amount is not shown in transation history, make that transaction visible as both  deducted from main cash balance and added to savings and cheeti deductions respectively",
          "Also in history"
        ]
      },
      "acceptanceCriteria": [
        "Transaction History shows additional rows representing: (1) 10% savings deduction and (2) cheeti/user-defined daily deduction, for any date where the computed amounts are non-zero.",
        "Day-wise Transactions shows those two additional rows for the selected date (when non-zero).",
        "Filter Transactions results table shows those two additional rows for each date within the filtered range where the computed amounts are non-zero.",
        "Monthly Transactions provides a way to view these derived deduction rows for the selected month (e.g., via additional selectable transaction types or an 'All types' mode that includes derived rows).",
        "The derived rows are clearly labeled in English (e.g., \"10% Savings\" and \"Cheeti Deduction\") and are visually distinguishable from user-entered transactions."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Derive the 10% savings amount and cheeti amount from the existing localStorage sources used by the app, and keep all existing stored transactions unchanged (i.e., do not physically create new stored transactions for these derived rows).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Just keep everything as it is"
        ]
      },
      "acceptanceCriteria": [
        "No new persistent transactions are written to the existing localStorage transactions key as part of displaying 10%/cheeti rows.",
        "Derived amounts are sourced from the same localStorage records already used by the app (10% savings and user deductions), and display updates correctly when the underlying transactions/deductions change."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure derived rows do not break existing actions: users cannot edit/delete derived rows, and edit/delete continues to work for real transactions exactly as before.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "keep everything as it is"
        ]
      },
      "acceptanceCriteria": [
        "Edit and Delete buttons/actions are not shown (or are disabled) for derived 10%/cheeti rows.",
        "Edit/Delete for normal transactions still works and does not affect derived-row rendering other than recalculating the derived amounts as it does today."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update list sorting and presentation so derived rows appear under the correct date and do not cause duplicate counting in existing summary/stat calculations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-12"
        ],
        "quotes": [
          "incorporate this in entire transaction like in monthly transaction, daily transactions, filter transaction page etc.",
          "make that transaction visible as both  deducted from main cash balance and added to savings and cheeti deductions respectively"
        ]
      },
      "acceptanceCriteria": [
        "Derived rows display under the correct day in each view (same day key logic as existing daily/user-deduction storage).",
        "Existing summary cards/stats (daily stats, filter stats, balances) remain correct and are not double-counted due to derived rows being added to UI lists.",
        "Within each day, derived rows have a consistent ordering relative to normal transactions (documented and consistent across views)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Fix any TypeScript/type mismatches introduced by displaying derived rows (since they are not part of the backend TransactionType union) without changing backend canister interfaces.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "make that transaction visible"
        ]
      },
      "acceptanceCriteria": [
        "Frontend compiles without TypeScript errors after introducing derived transaction row rendering.",
        "No changes are required to Motoko types or backend candid to support the derived display rows."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Resolve the current build/deployment failure so the updated app can successfully build and deploy with the new derived-row changes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "❌ Failed to build your app",
          "❌ Application creation unsuccessful"
        ]
      },
      "acceptanceCriteria": [
        "A full build completes successfully after implementing the changes.",
        "The deployed draft runs and the affected pages render without runtime errors."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the stored transactions data model unchanged; do not add new persisted transactions for 10% savings or cheeti deductions."
  ],
  "nonGoals": [
    "Changing the 10% calculation or rounding rules already implemented.",
    "Changing how balances are computed beyond what is necessary to render derived rows in lists.",
    "Implementing backend persistence/linking for derived rows (i.e., no new backend transaction records)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}