{
  "kind": "build_request",
  "title": "Color transaction amount text by direction (Outgoing=red, Incoming=green) across all tabs",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all transaction amount displays to color outgoing amounts red and incoming amounts green across every tab and every transaction view, using transaction direction (transactionType) rather than the numeric sign of the amount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Color the amount font red in color which is outgoing and like wise incoming should be in green, do this in every tab and transaction"
        ]
      },
      "acceptanceCriteria": [
        "In Transaction History (frontend/src/components/TransactionHistory.tsx), amount text is red for outgoing transaction types (cashOut, upiOut, savingsOut, deductionsOut) and green for incoming transaction types (cashIn, upiIn), regardless of whether stored amounts are positive.",
        "In Monthly Transactions (frontend/src/components/MonthlyTransactions.tsx), amount text in the on-screen table is red for outgoing and green for incoming, and the same rule is applied in the generated HTML report (the amount cell uses outgoing=red/incoming=green consistently).",
        "In Day-wise Transactions (frontend/src/components/DaywiseTransactions.tsx), all amount text rendered for transaction rows is red for outgoing and green for incoming; derived deduction/savings rows are treated as outgoing (red). The generated day-wise HTML report also uses outgoing=red/incoming=green for all amount cells and summary lines.",
        "In Filter Transactions (frontend/src/components/FilterTransactions.tsx), amount text in the filtered transaction results list/table is red for outgoing and green for incoming; derived deduction/savings rows are treated as outgoing (red).",
        "No amount coloring uses `Number(amount) >= 0` as the primary determinant for in/out coloring (direction must come from transaction type / derived-row kind)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (useInternetIdentity, useActor, main.tsx).",
    "Backend remains single-actor; no backend changes are required for this UI-only styling update."
  ],
  "nonGoals": [
    "Changing how amounts are stored/calculated in the backend (e.g., making outgoing amounts negative).",
    "Adding new transaction types or new tabs/features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}