{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve Archive month selection UI and enable month selection in History",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the selected month/year in the Overview Archive area as a distinct tile-like element separate from the calendar trigger button.",
      "acceptanceCriteria": [
        "On the Overview tab, the Archive section shows the selected month/year prominently inside a tile/card element (e.g., a bordered/filled pill or mini-card) that is visually distinct from the calendar trigger button.",
        "The month/year shown in the tile updates immediately when the user selects a different month.",
        "User-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Update the Overview > Archive UI to render the selected month/year inside a dedicated, tile-like element within the Archive card (separate from the calendar trigger Button), and keep it in sync with the existing archiveMonth state so it updates immediately after Calendar selection."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reposition and compact the Overview month archive selector and its reset action so it is intuitive and does not dominate the page.",
      "acceptanceCriteria": [
        "The archive month selector (calendar trigger) is placed in a more compact, intuitive position within the Overview tab (e.g., aligned to the right of the Archive header, or otherwise reducing vertical space).",
        "The reset action remains available when viewing an archived month and is clearly associated with the archive controls.",
        "The BalanceCards grid remains fully visible without excessive scrolling on typical viewport sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Redesign the Archive section layout to be more compact (e.g., align controls to the right of the Archive header, remove the full-width selector button behavior, and group the calendar trigger + selected-month tile + reset action together) to reduce vertical space and keep BalanceCards visible with minimal scrolling."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed to support the redesigned compact Archive controls, add/adjust minimal global utility styles (without touching frontend/src/components/ui) to ensure consistent spacing/appearance for the new tile-like month display and compact control alignment."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add in-page month/year selection controls to History and apply them to History filtering, using Overview archive selection as initial state when present.",
      "acceptanceCriteria": [
        "In the History tab (TransactionHistory), provide an in-page control to select a month/year to view (can reuse the calendar-popover pattern used in Dashboard).",
        "Selecting an older month in History updates the displayed transactions for that month immediately (no full page reload).",
        "A clear action exists to return to the current month from an archived month view.",
        "If Overview has already set session parameters (overviewArchiveYear/overviewArchiveMonth), History uses them as the initial selection when opening the History tab.",
        "By default (no archive selection), History continues to show the current month."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionHistory.tsx",
          "operation": "modify",
          "description": "Implement a month/year selection control inside TransactionHistory using the existing Popover + Calendar UI pattern (importing the same shadcn/ui components already used elsewhere, without editing frontend/src/components/ui). Initialize History's selected month from sessionStorage (overviewArchiveYear/overviewArchiveMonth) when present; otherwise default to the current month. Update filtering and derived-row date range calculations to use the in-page selected month state, and replace the current reload-based 'Back to Current Month' behavior with a state/session clear that updates results immediately."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "If necessary to support History’s month selection persistence/initialization without reloads, extend or reuse the existing session parameter helpers so TransactionHistory can reliably read, write, and clear overviewArchiveYear/overviewArchiveMonth while keeping behavior consistent across tab navigation."
        }
      ]
    }
  ]
}