{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Monthly tab blank screen and harden Monthly Transactions rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the runtime error triggered when opening the Dashboard \"Monthly\" tab so the Monthly Transactions view renders reliably.",
      "acceptanceCriteria": [
        "Clicking the \"Monthly\" tab no longer results in a blank screen.",
        "The Monthly Transactions view renders successfully on first load (even with no transactions).",
        "No uncaught exceptions are thrown in the browser console when switching to the Monthly tab."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTransactions.tsx",
          "operation": "modify",
          "description": "Remove the crashing Monthly type filter setup by replacing the Select's empty-string option with a non-empty sentinel (e.g., \"all\") and updating the component state/filtering/PDF label logic accordingly (Radix/shadcn Select items must not use an empty value). Ensure the Monthly tab can mount without throwing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make Monthly Transactions filtering/search resilient to partial or unexpected transaction data so the UI never crashes and always renders safe fallbacks.",
      "acceptanceCriteria": [
        "Typing into the Monthly search box does not crash the page even if some transactions have empty/undefined descriptions.",
        "Filtering by each transaction type option (and derived row types) does not crash the page and produces a stable rendered table state.",
        "When an unexpected/unknown transaction type is encountered, the UI displays a reasonable fallback label (e.g., \"Unknown\") and continues rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MonthlyTransactions.tsx",
          "operation": "modify",
          "description": "Harden search and row rendering against data-shape issues: safely coerce description to a string for searching (e.g., (description ?? '').toLowerCase()), guard any string operations, and ensure rendering uses fallbacks when fields are missing. Add a safe transaction-type labeling strategy that tolerates unexpected values (keep a visible fallback label like \"Unknown\" and avoid calling transaction-type helpers with invalid values)."
        }
      ]
    }
  ]
}